Repository: ajspadial/behat-ast
Catalog: MinkExtension/*.xliff
Languages: ast

# i-am-homepage
source: /^(?:|I )am on (?:|the )homepage$/
ast: /^toi na páxina d'aniciu/

# i-go-to-homepage
source: /^(?:|I )go to (?:|the )homepage$/
ast: /^voi pa la páxina d'aniciu/

# i-am-on-page
source: /^(?:|I )am on "(?P<page>[^"]+)"$/
ast: /^toi en "(?P<page>[^"]+)"$/

# i-go-to-page
source: /^(?:|I )go to "(?P<page>[^"]+)"$/
ast: /^voi pa "(?P<page>[^"]+)"$/

# reload-the-page
source: /^(?:|I )reload the page$/
ast: /^recargo la páxina$/

# move-backward-one-page
source: /^(?:|I )move backward one page$/
ast: /^voi pa tras una páxina$/

# move-forward-one-page
source: /^(?:|I )move forward one page$/
ast: /^voi p'alantre una páxina$/

# i-press-button
source: /^(?:|I )press "(?P<button>(?:[^"]|\\")*)"$/
ast: /^calco "(?P<button>(?:[^"]|\\")*)"$/

# i-follow-link
source: /^(?:|I )follow "(?P<link>(?:[^"]|\\")*)"$/
ast: /^sigo "(?P<link>(?:[^"]|\\")*)"$/

# i-fill-in-field-with-value
source: /^(?:|I )fill in "(?P<field>(?:[^"]|\\")*)" with "(?P<value>(?:[^"]|\\")*)"$/
ast: /^relleno "(?P<field>(?:[^"]|\\")*)" con "(?P<value>(?:[^"]|\\")*)"$/

# i-fill-in-value-for-field
source: /^(?:|I )fill in "(?P<value>(?:[^"]|\\")*)" for "(?P<field>(?:[^"]|\\")*)"$/
ast: /^relleno con "(?P<value>(?:[^"]|\\")*)" a "(?P<field>(?:[^"]|\\")*)"$/

source: /^(?:|I )fill in the following:$/
ast: /^relleno lo siguiente:$/

# i-select-option-from-select
source: /^(?:|I )select "(?P<option>(?:[^"]|\\")*)" from "(?P<select>(?:[^"]|\\")*)"$/
ast: /^escueyo "(?P<option>(?:[^"]|\\")*)" de "(?P<select>(?:[^"]|\\")*)"$/

# i-additionally-select-option-from-select
source: /^(?:|I )additionally select "(?P<option>(?:[^"]|\\")*)" from "(?P<select>(?:[^"]|\\")*)"$/
ast: /^amás escueyo "(?P<option>(?:[^"]|\\")*)" de "(?P<select>(?:[^"]|\\")*)"$/

# i-check-option
source: /^(?:|I )check "(?P<option>(?:[^"]|\\")*)"$/
ast: /^marco "(?P<option>(?:[^"]|\\")*)"$/

# i-uncheck-option
source: /^(?:|I )uncheck "(?P<option>(?:[^"]|\\")*)"$/
ast: /^desmarco "(?P<option>(?:[^"]|\\")*)"$/

# i-attach-the-file-to-field
source: /^(?:|I )attach the file "(?P<path>[^"]*)" to "(?P<field>(?:[^"]|\\")*)"$/
ast: /^axunto l'archivu "(?P<path>[^"]*)" a "(?P<field>(?:[^"]|\\")*)"$/

# i-should-see-text
source: /^(?:|I )should see "(?P<text>(?:[^"]|\\")*)"$/
ast: /^teo ver "(?P<text>(?:[^"]|\\")*)"$/

# i-should-not-see-text
source: /^(?:|I )should not see "(?P<text>(?:[^"]|\\")*)"$/
ast: /^nun teo ver "(?P<text>(?:[^"]|\\")*)"$/

# i-should-see-text-matching
source: /^(?:|I )should see text matching (?P<pattern>"(?:[^"]|\\")*")$/
ast: /^teo ve'l testu col patrón (?P<pattern>"(?:[^"]|\\")*")$/

# i-should-not-see-text-matching
source: /^(?:|I )should not see text matching (?P<pattern>"(?:[^"]|\\")*")$/
ast: /^nun teo ve'l testu col patrón (?P<pattern>"(?:[^"]|\\")*")$/

# the-response-should-contain
source: /^the response should contain "(?P<text>(?:[^"]|\\")*)"$/
ast: /^la respuesta tien d'incluyir "(?P<text>(?:[^"]|\\")*)"$/

# the-response-should-not-contain
source: /^the response should not contain "(?P<text>(?:[^"]|\\")*)"$/
ast: /^la respuesta nun tien d'incluyir "(?P<text>(?:[^"]|\\")*)"$/

# the-field-should-contain-value
source: /^the "(?P<field>(?:[^"]|\\")*)" field should contain "(?P<value>(?:[^"]|\\")*)"$/
ast: /^el campu "(?P<field>(?:[^"]|\\")*)" tien d'incluyir "(?P<value>(?:[^"]|\\")*)"$/

# the-field-should-not-contain-value
source: /^the "(?P<field>(?:[^"]|\\")*)" field should not contain "(?P<value>(?:[^"]|\\")*)"$/
ast: /^el campu "(?P<field>(?:[^"]|\\")*)" nun tien d'incluyir "(?P<value>(?:[^"]|\\")*)"$/

# the-checkbox-should-be-checked
source: /^the "(?P<checkbox>(?:[^"]|\\")*)" checkbox should be checked$/
ast: /^la casiella de seleción "(?P<checkbox>[^"]*)" tien de tar marcada$/

# the-checkbox-should-not-be-checked
source: /^the "(?P<checkbox>(?:[^"]|\\")*)" checkbox should not be checked$/
ast: /^la casiella de seleción "(?P<checkbox>(?:[^"]|\\")*)" nun tien de tar marcada$/

# i-should-be-on-page
source: /^(?:|I )should be on "(?P<page>[^"]+)"$/
ast: /^teo de tar en "(?P<page>[^"]+)"$/

# the-url-should-match
source: /^the (?i)url(?-i) should match (?P<pattern>"(?:[^"]|\\")*")$/
ast: /^la URL tien de segui'l patrón (?P<pattern>"(?:[^"]|\\")*")$/

# the-element-should-contain
source: /^the "(?P<element>[^"]*)" element should contain "(?P<value>(?:[^"]|\\")*)"$/
ast: /^l'elementu "(?P<element>[^"]*)" tien d'incluyir "(?P<value>(?:[^"]|\\")*)"$/

# i-should-see-text-in-element
source: /^(?:|I )should see "(?P<text>(?:[^"]|\\")*)" in the "(?P<element>[^"]*)" element$/
ast: /^teo de ver "(?P<text>(?:[^"]|\\")*)" nel elementu "(?P<element>[^"]*)"$/

# i-should-not-see-text-in-element
source: /^(?:|I )should not see "(?P<text>(?:[^"]|\\")*)" in the "(?P<element>[^"]*)" element$/
ast: /^nun teo de ver "(?P<text>(?:[^"]|\\")*)" nel elementu "(?P<element>[^"]*)"$/

# i-should-see-element
source: /^(?:|I )should see an? "(?P<element>[^"]*)" element$/
ast: /^teo de ver un elementu "(?P<element>[^"]*)"$/

# i-should-not-see-element
source: /^(?:|I )should not see an? "(?P<element>[^"]*)" element$/
ast: /^nun teo de ver un elementu "(?P<element>[^"]*)"$/

# i-should-see-num-elements
source: /^(?:|I )should see (?P<num>\d+) "(?P<element>[^"]*)" elements?$/
ast: /^teo de ver (?P<num>\d+) "(?P<element>[^"]*)" elementos$/

# the-response-status-code-should-be
source: /^the response status code should be (?P<code>\d+)$/
ast: /^el códigu d'estau de la respuesta tien de ser (?P<code>\d+)$/

# the-response-status-code-should-not-be
source: /^the response status code should not be (?P<code>\d+)$/
ast: /^el códigu d'estau de la respuesta nun tien de ser (?P<code>\d+)$/

source: /^print last response$/
ast: /^imprime la respuesta cabera$/

source: /^show last response$/
ast: /^muestra la respuesta cabera$/
